<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Import-pandas" data-toc-modified-id="Import-pandas-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Import pandas</a></span></li><li><span><a href="#Series" data-toc-modified-id="Series-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Series</a></span></li><li><span><a href="#DataFrame" data-toc-modified-id="DataFrame-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>DataFrame</a></span></li><li><span><a href="#dfA-add-dfb" data-toc-modified-id="dfA-add-dfb-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>dfA add dfb</a></span></li><li><span><a href="#Deal-with-nan" data-toc-modified-id="Deal-with-nan-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Deal with nan</a></span></li><li><span><a href="#Build-a--multiindex" data-toc-modified-id="Build-a--multiindex-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Build a  multiindex</a></span></li><li><span><a href="#Slice-the-index" data-toc-modified-id="Slice-the-index-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Slice the index</a></span></li><li><span><a href="#Concatenate" data-toc-modified-id="Concatenate-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Concatenate</a></span></li><li><span><a href="#Merge" data-toc-modified-id="Merge-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>Merge</a></span></li><li><span><a href="#Groupby" data-toc-modified-id="Groupby-10"><span class="toc-item-num">10&nbsp;&nbsp;</span>Groupby</a></span></li><li><span><a href="#Filter" data-toc-modified-id="Filter-11"><span class="toc-item-num">11&nbsp;&nbsp;</span>Filter</a></span></li><li><span><a href="#pivot-table" data-toc-modified-id="pivot-table-12"><span class="toc-item-num">12&nbsp;&nbsp;</span>pivot table</a></span></li><li><span><a href="#isin" data-toc-modified-id="isin-13"><span class="toc-item-num">13&nbsp;&nbsp;</span>isin</a></span></li><li><span><a href="#Cut" data-toc-modified-id="Cut-14"><span class="toc-item-num">14&nbsp;&nbsp;</span>Cut</a></span></li><li><span><a href="#qcut" data-toc-modified-id="qcut-15"><span class="toc-item-num">15&nbsp;&nbsp;</span>qcut</a></span></li><li><span><a href="#pandas-with-str" data-toc-modified-id="pandas-with-str-16"><span class="toc-item-num">16&nbsp;&nbsp;</span>pandas with str</a></span></li><li><span><a href="#query" data-toc-modified-id="query-17"><span class="toc-item-num">17&nbsp;&nbsp;</span>query</a></span></li><li><span><a href="#eval" data-toc-modified-id="eval-18"><span class="toc-item-num">18&nbsp;&nbsp;</span>eval</a></span></li><li><span><a href="#datetime" data-toc-modified-id="datetime-19"><span class="toc-item-num">19&nbsp;&nbsp;</span>datetime</a></span></li><li><span><a href="#Timedelta" data-toc-modified-id="Timedelta-20"><span class="toc-item-num">20&nbsp;&nbsp;</span>Timedelta</a></span></li><li><span><a href="#DatetimeIndex" data-toc-modified-id="DatetimeIndex-21"><span class="toc-item-num">21&nbsp;&nbsp;</span>DatetimeIndex</a></span></li><li><span><a href="#to_period" data-toc-modified-id="to_period-22"><span class="toc-item-num">22&nbsp;&nbsp;</span>to_period</a></span></li><li><span><a href="#date_range" data-toc-modified-id="date_range-23"><span class="toc-item-num">23&nbsp;&nbsp;</span>date_range</a></span></li><li><span><a href="#period_range" data-toc-modified-id="period_range-24"><span class="toc-item-num">24&nbsp;&nbsp;</span>period_range</a></span></li><li><span><a href="#timedelta-range" data-toc-modified-id="timedelta-range-25"><span class="toc-item-num">25&nbsp;&nbsp;</span>timedelta range</a></span></li><li><span><a href="#rolling" data-toc-modified-id="rolling-26"><span class="toc-item-num">26&nbsp;&nbsp;</span>rolling</a></span></li><li><span><a href="#assign" data-toc-modified-id="assign-27"><span class="toc-item-num">27&nbsp;&nbsp;</span>assign</a></span></li><li><span><a href="#sample" data-toc-modified-id="sample-28"><span class="toc-item-num">28&nbsp;&nbsp;</span>sample</a></span></li><li><span><a href="#to_numeric" data-toc-modified-id="to_numeric-29"><span class="toc-item-num">29&nbsp;&nbsp;</span>to_numeric</a></span></li></ul></div>

## Import pandas

In [55]:
import pandas as pd
import numpy as np

## Series

In [2]:
data=pd.Series([0.25,0.5,0.75,1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [3]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [4]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
data[0]

0.25

In [6]:
data[1]

0.5

In [8]:
population_dict = {'California': 3,
                   'Texas': 2,
                   'New York': 1,
                   'Florida': 12,
                   'Illinois': 13}
pd.Series(population_dict)

California     3
Texas          2
New York       1
Florida       12
Illinois      13
dtype: int64

## DataFrame

In [13]:
population_dict = {'California': 3,
                   'Texas': 2,
                   'New York': 1,
                   'Florida': 12,
                   'Illinois': 13}
area_dict={'California':42,
          'Texas':69,
          'New York':141,
          'Florida':17,
          'Illinois':14}
state=pd.DataFrame({'population':population_dict,'area':area_dict})
state

            population  area
California           3    42
Florida             12    17
Illinois            13    14
New York             1   141
Texas                2    69

In [14]:
state.index

Index(['California', 'Florida', 'Illinois', 'New York', 'Texas'], dtype='object')

In [15]:
state.columns

Index(['population', 'area'], dtype='object')

In [16]:
state['area']

California     42
Florida        17
Illinois       14
New York      141
Texas          69
Name: area, dtype: int64

In [31]:
df = pd.DataFrame(np.random.randint(0, 10, size=(3, 2)),
                  columns=['foo', 'bear'], index=['a', 'b', 'c'])
df

   foo  bear
a    1     2
b    4     6
c    1     2

In [32]:
A=np.zeros(3,dtype=[('A','i8'),('B','f8')])
pd.DataFrame(A)

   A    B
0  0  0.0
1  0  0.0
2  0  0.0

## dfA add dfb

In [33]:
A=pd.DataFrame(np.random.randint(0,20,(2,2)),columns=list('AB'))
B=pd.DataFrame(np.random.randint(0,10,(3,3)),columns=list('ABC'))
print(A)
print(B)

   A   B
0  9  14
1  0   2
   A  B  C
0  5  7  3
1  3  3  5
2  3  9  6

In [34]:
A.add(B)

      A     B   C
0  14.0  21.0 NaN
1   3.0   5.0 NaN
2   NaN   NaN NaN

In [35]:
A.add(B,fill_value=0) #fill the nan

      A     B    C
0  14.0  21.0  3.0
1   3.0   5.0  5.0
2   3.0   9.0  6.0

## Deal with nan

In [36]:
vals=np.array([1,np.nan,3,4])
print(vals)
print(vals.dtype)

[ 1. nan  3.  4.]
float64

In [39]:
#treating Not a Numbers (NaNs) as zero.
print(np.nansum(vals))
print(np.nanmin(vals))
print(np.nanmax(vals))

8.0
1.0
4.0

In [40]:
df = pd.DataFrame(np.random.randint(10, size=(3, 4)), columns=list('QRST'))
df

   Q  R  S  T
0  2  8  1  5
1  6  7  3  4
2  3  7  5  3

In [41]:
df['T']=np.nan
df

   Q  R  S   T
0  2  8  1 NaN
1  6  7  3 NaN
2  3  7  5 NaN

In [48]:
df.iloc[2,2]=np.nan
df

   Q  R    S   T
0  2  8  1.0 NaN
1  6  7  3.0 NaN
2  3  7  NaN NaN

In [54]:
df.dropna(axis=0,thresh=3) #Require that many non-NA values.

   Q  R    S   T
0  2  8  1.0 NaN
1  6  7  3.0 NaN

## Build a  multiindex

In [55]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [57]:
index=pd.MultiIndex.from_tuples(index)
index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [58]:
pop.reindex(index)

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [59]:
pop.reindex(index).unstack()

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [60]:
pd.MultiIndex.from_arrays([['a','a','b','b'],[1,2,1,2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [61]:
pd.MultiIndex.from_tuples([('a',1),('a',2),('b',1),('b',2)])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [64]:
#you can change the order
pd.MultiIndex(levels=[['a','b'],[1,2]],labels=[[0,0,1,1],[0,1,0,1]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [65]:
#combine to make a product
index=pd.MultiIndex.from_product([['a','b'],[1,2]])
pd.Series(np.arange(4),index=index)

a  1    0
   2    1
b  1    2
   2    3
dtype: int64

In [58]:
arrays = [np.array([1, 2, 3]),
             np.array([5, 4, 3])]

df5 = pd.DataFrame(np.random.rand(3, 2), index=arrays)
df5.head()

            0         1
1 5  0.367888  0.877737
2 4  0.772634  0.157368
3 3  0.715765  0.335317

In [62]:
tuples = list(zip(*arrays))
print(tuples)
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df6 = pd.DataFrame(np.random.rand(3, 2), index=index)
df6.head()

[(1, 5), (2, 4), (3, 3)]

                     0         1
first second
1     5       0.513194  0.798718
2     4       0.474134  0.525261
3     3       0.826072  0.023061

## Slice the index

In [68]:
midx = pd.MultiIndex.from_product([['A0', 'A1'], ['B0', 'B1', 'B2', 'B3']])
df = pd.DataFrame(np.arange(16).reshape(
    8, 2), index=midx, columns=['foo', 'bar'])
df

       foo  bar
A0 B0    0    1
   B1    2    3
   B2    4    5
   B3    6    7
A1 B0    8    9
   B1   10   11
   B2   12   13
   B3   14   15

In [70]:
idx=pd.IndexSlice
df.loc[idx[:,idx['B2','B0']],:]

       foo  bar
A0 B0    0    1
   B2    4    5
A1 B0    8    9
   B2   12   13

## Concatenate

In [72]:
df1 = pd.Series(np.arange(4))
df2 = pd.Series(np.arange(4))
pd.concat([df1, df2], axis=1)
# could use the parameter 'join_axes' to specify the columns you want to follow

   0  1
0  0  0
1  1  1
2  2  2
3  3  3

## Merge

In [73]:
df1 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [1, 2, 3, 4]})
df2 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [3, 1, 4, 2]})
print(df1)
print(df2)

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

In [78]:
pd.merge(df1,df2,on='name',suffixes=['hello','hellohello'])

   name  rankhello  rankhellohello
0   Bob          1               3
1  Jake          2               1
2  Lisa          3               4
3   Sue          4               2

## Groupby

In [80]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', "C"],
                   'data': range(6)}, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [81]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [82]:
df.groupby('key').median()

     data
key
A     1.5
B     2.5
C     3.5

In [83]:
df.groupby('key').describe() #state the stats

     data
    count mean      std  min   25%  50%   75%  max
key
A     2.0  1.5  2.12132  0.0  0.75  1.5  2.25  3.0
B     2.0  2.5  2.12132  1.0  1.75  2.5  3.25  4.0
C     2.0  3.5  2.12132  2.0  2.75  3.5  4.25  5.0

In [104]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'], 'data1': range(
    6), 'data2': np.random.randint(0, 10, 6)}, columns=['key', 'data1', 'data2'])
df

  key  data1  data2
0   A      0      7
1   B      1      3
2   C      2      5
3   A      3      3
4   B      4      4
5   C      5      1

In [105]:
df.groupby('key').aggregate(
    {'data1': ['min', np.median, 'max'], 'data2': 'min'})

    data1            data2
      min median max   min
key
A       0    1.5   3     3
B       1    2.5   4     3
C       2    3.5   5     1

In [107]:
df.groupby('key').transform(lambda x:x-x.mean())

   data1  data2
0   -1.5    2.0
1   -1.5   -0.5
2   -1.5    2.0
3    1.5   -2.0
4    1.5    0.5
5    1.5   -2.0

In [108]:
df1=df.set_index('key')
mapping={'A':'','B':'','C':''}
df1.groupby(mapping).sum() #Groupby the index and map the index to another string

    data1  data2
     10     16
      5      7

## Filter 
Subset rows or columns of dataframe according to labels in
the specified index.

In [40]:
df2 = pd.DataFrame({'one': [1, 4], 'two': [2, 5], 'three': [
                   3, 6]}, index=['mouse', 'rabbit'])
df2

        one  two  three
mouse     1    2      3
rabbit    4    5      6

In [49]:
df2.filter(items=['rabbit', 'three'])

        three
mouse       3
rabbit      6

In [42]:
df2.filter(regex='e$',axis=1)

        one  three
mouse     1      3
rabbit    4      6

In [43]:
df2.filter(like='ne',axis=1)

        one
mouse     1
rabbit    4

## pivot

In [28]:
titanic.pivot_table(index='sex',
             columns='pclass',
             values='age')

pclass          1          2          3
sex
female  34.611765  28.722973  21.750000
male    41.281386  30.740707  26.507589

## pivot table
Create a spreadsheet-style pivot table as a DataFrame.

In [25]:
#Import dataset
import seaborn as sns
titanic=sns.load_dataset('titanic')

titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [110]:
titanic.pivot_table(values='survived',index='sex',columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [113]:
age = pd.cut(x=titanic['age'], bins=[0, 18, 80])
titanic.pivot_table(values='survived', index=['sex', age], columns='class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 80]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 80]  0.375000  0.071429  0.133663

In [121]:
fare = pd.qcut(titanic['fare'], 2)
titanic.pivot_table(values='survived', index=['sex', age], columns=[fare, 'class'])

fare            (-0.001, 14.454]                     (14.454, 512.329]  \
class                      First    Second     Third             First
sex    age
female (0, 18]               NaN  1.000000  0.714286          0.909091
       (18, 80]              NaN  0.880000  0.444444          0.972973
male   (0, 18]               NaN  0.000000  0.260870          0.800000
       (18, 80]              0.0  0.098039  0.125000          0.391304

fare
class              Second     Third
sex    age
female (0, 18]   1.000000  0.318182
       (18, 80]  0.914286  0.391304
male   (0, 18]   0.818182  0.178571
       (18, 80]  0.030303  0.192308

In [122]:
#Specified the columns you want to keep
titanic.pivot_table(index='sex',columns='class',aggfunc={'survived':sum,'fare':'mean'})

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47

## isin

In [3]:
df = pd.DataFrame(
    {'alphabet': ['A', 'B', 'C', 'A', 'B', 'C'], 'number': np.arange(6)})
df.alphabet.isin(['A', 'B'])

0     True
1     True
2    False
3     True
4     True
5    False
Name: alphabet, dtype: bool

In [6]:
df[df.alphabet.isin(['A', 'B'])]

  alphabet  number
0        A       0
1        B       1
3        A       3
4        B       4

## Cut 
Bin values into discrete intervals.

In [112]:
age=pd.cut(x=titanic['age'],bins=[0,18,80])
age.head()

0    (18, 80]
1    (18, 80]
2    (18, 80]
3    (18, 80]
4    (18, 80]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 80]]

## qcut 
Discretize variable into equal-sized buckets based on rank or based on sample quantiles

In [118]:
fare=pd.qcut(x=titanic['fare'],q=2)
print(fare.head())
print(fare.value_counts())

0     (-0.001, 14.454]
1    (14.454, 512.329]
2     (-0.001, 14.454]
3    (14.454, 512.329]
4     (-0.001, 14.454]
Name: fare, dtype: category
Categories (2, interval[float64]): [(-0.001, 14.454] < (14.454, 512.329]]
(-0.001, 14.454]     447
(14.454, 512.329]    444
Name: fare, dtype: int64

## pandas with str

In [124]:
data=['peter','Paul','MARY','gUIDO']
df=pd.Series(data)
df

0    peter
1     Paul
2     MARY
3    gUIDO
dtype: object

In [125]:
df.str.capitalize()

0    Peter
1     Paul
2     Mary
3    Guido
dtype: object

In [126]:
df.str.lower()

0    peter
1     paul
2     mary
3    guido
dtype: object

In [129]:
df.str.len()

0    5
1    4
2    4
3    5
dtype: int64

In [130]:
df.str.startswith('g') #First alphabet

0    False
1    False
2    False
3     True
dtype: bool

In [131]:
name = pd.Series(['Graham Chapman', 'John Cleese', 'Terry Gilliam',
                  'Eric Idle', 'Terry Jones', 'Michael Palin'])
name

0    Graham Chapman
1       John Cleese
2     Terry Gilliam
3         Eric Idle
4       Terry Jones
5     Michael Palin
dtype: object

In [132]:
name.str.split()

0    [Graham, Chapman]
1       [John, Cleese]
2     [Terry, Gilliam]
3         [Eric, Idle]
4       [Terry, Jones]
5     [Michael, Palin]
dtype: object

In [135]:
name.str.split().str.get(1)

0    Chapman
1     Cleese
2    Gilliam
3       Idle
4      Jones
5      Palin
dtype: object

In [138]:
name.str.split().str[0]

0     Graham
1       John
2      Terry
3       Eric
4      Terry
5    Michael
dtype: object

In [140]:
full_monte = pd.DataFrame(
    {'name': name, 'info': ['B|C|D', 'B|D', 'A|C', 'B|D', 'B|C', 'B|C|D']})
full_monte

             name   info
0  Graham Chapman  B|C|D
1     John Cleese    B|D
2   Terry Gilliam    A|C
3       Eric Idle    B|D
4     Terry Jones    B|C
5   Michael Palin  B|C|D

In [141]:
#Series.str.get_dummies(sep='|')
full_monte['info'].str.get_dummies(split='|')

   A  B  C  D
0  0  1  1  1
1  0  1  0  1
2  1  0  1  0
3  0  1  0  1
4  0  1  1  0
5  0  1  1  1

## query
Query the columns of a frame with a boolean expression.
boolen

In [16]:
df=pd.DataFrame(np.random.randint(0,10,16).reshape(4,4),columns=list('abcd'))
df

   a  b  c  d
0  7  1  9  8
1  2  4  8  4
2  5  2  4  2
3  9  9  4  7

In [17]:
df.query('a>b')

   a  b  c  d
0  7  1  9  8
2  5  2  4  2

In [19]:
df.query('a in [7,9]')

   a  b  c  d
0  7  1  9  8
3  9  9  4  7

## eval
Evaluate a string describing operations on DataFrame columns.

In [158]:
df.eval('a+b')

0    13
1    10
2    18
3     5
dtype: int64

## datetime

In [164]:
print(pd.to_datetime('4th of July,2015'))
print(pd.to_datetime('2015-07-04'))
print(pd.to_datetime('2015/7/4'))

2015-07-04 00:00:00
2015-07-04 00:00:00
2015-07-04 00:00:00

In [175]:
from datetime import datetime
pd.to_datetime([datetime(year=2019,month=2,day=16),'2019-02-17','2019/02/18','2019-Feb-19'])

DatetimeIndex(['2019-02-16', '2019-02-17', '2019-02-18', '2019-02-19'], dtype='datetime64[ns]', freq=None)

In [169]:
index = pd.to_datetime('2019-Feb-16')
index

Timestamp('2019-02-16 00:00:00')

## Timedelta 
The type can let you compute the data

In [166]:
index = pd.to_datetime('2018-Feb-16')
index+pd.to_timedelta(arg=np.arange(12), unit='D')

DatetimeIndex(['2018-02-16', '2018-02-17', '2018-02-18', '2018-02-19',
               '2018-02-20', '2018-02-21', '2018-02-22', '2018-02-23',
               '2018-02-24', '2018-02-25', '2018-02-26', '2018-02-27'],
              dtype='datetime64[ns]', freq=None)

## DatetimeIndex 
Try to make an index

In [167]:
index=pd.DatetimeIndex(['2019-02-16','2019-02-17','2019-02-18'])
pd.Series(np.arange(3),index=index)

2019-02-16    0
2019-02-17    1
2019-02-18    2
dtype: int64

## to_period

In [176]:
dates=pd.to_datetime(['2019/07/19','2019/07/20','2019/07/21'])
dates

DatetimeIndex(['2019-07-19', '2019-07-20', '2019-07-21'], dtype='datetime64[ns]', freq=None)

In [179]:
print(dates.to_period(freq='D'))
print(dates.to_period(freq='M'))

PeriodIndex(['2019-07-19', '2019-07-20', '2019-07-21'], dtype='period[D]', freq='D')
PeriodIndex(['2019-07', '2019-07', '2019-07'], dtype='period[M]', freq='M')

## date_range 
Return a fixed frequency DatetimeIndex.

In [182]:
pd.date_range(start='2019-07-19',periods=10,freq='D')

DatetimeIndex(['2019-07-19', '2019-07-20', '2019-07-21', '2019-07-22',
               '2019-07-23', '2019-07-24', '2019-07-25', '2019-07-26',
               '2019-07-27', '2019-07-28'],
              dtype='datetime64[ns]', freq='D')

## period_range

In [183]:
pd.period_range(start='2019-07',periods=10,freq='M')

PeriodIndex(['2019-07', '2019-08', '2019-09', '2019-10', '2019-11', '2019-12',
             '2020-01', '2020-02', '2020-03', '2020-04'],
            dtype='period[M]', freq='M')

## timedelta range

In [184]:
pd.timedelta_range(start=0,periods=9,freq='2h30T') #T=minute

TimedeltaIndex(['00:00:00', '02:30:00', '05:00:00', '07:30:00', '10:00:00',
                '12:30:00', '15:00:00', '17:30:00', '20:00:00'],
               dtype='timedelta64[ns]', freq='150T')

## rolling
Provides rolling window calculations.

In [192]:
x = pd.Series(np.arange(20), index=pd.date_range(start='2019-07-10', periods=20, freq='D'))
print(x.head())
print('-'*25)
# Center : Set the labels at the center of the window.
print(x.rolling(window=3,center=True).mean().head())

2019-07-10    0
2019-07-11    1
2019-07-12    2
2019-07-13    3
2019-07-14    4
Freq: D, dtype: int64
-------------------------
2019-07-10    NaN
2019-07-11    1.0
2019-07-12    2.0
2019-07-13    3.0
2019-07-14    4.0
Freq: D, dtype: float64

In [193]:
rolling=x.rolling(3,center=True)
data=pd.DataFrame({'input':x,'four-day rolling-sum':rolling.sum(),
                              'four-day-rolling-std':rolling.std()})
data.head()

            input  four-day rolling-sum  four-day-rolling-std
2019-07-10      0                   NaN                   NaN
2019-07-11      1                   3.0                   1.0
2019-07-12      2                   6.0                   1.0
2019-07-13      3                   9.0                   1.0
2019-07-14      4                  12.0                   1.0

## assign

In [9]:
# Assign new columns to a DataFrame
df = pd.DataFrame({'A': range(1, 11), 'B': np.random.randn(10)})
df.assign(new=lambda x: x.A*x.B)

    A         B       new
0   1 -2.418111 -2.418111
1   2 -0.074927 -0.149854
2   3 -0.198886 -0.596658
3   4 -0.629382 -2.517526
4   5 -0.959130 -4.795649
5   6 -0.599053 -3.594316
6   7 -0.331622 -2.321355
7   8  0.136752  1.094016
8   9  0.793235  7.139111
9  10  0.128498  1.284977

## sample

In [13]:
df.sample(n=5)

    A         B
2   3 -0.198886
7   8  0.136752
1   2 -0.074927
9  10  0.128498
8   9  0.793235

In [14]:
df.sample(frac=0.1)  # 10*0.1=1

   A         B
2  3 -0.198886

## to_numeric 
inttype

In [3]:
series=pd.Series(['1','2','3','4'])
pd.to_numeric(series)

0    1
1    2
2    3
3    4
dtype: int64

## Rank

In [8]:
df = pd.DataFrame({'a':[2.7, 3.1, 1.2, 4.1]})
df

     a
0  2.7
1  3.1
2  1.2
3  4.1

In [9]:
df.rank()

     a
0  2.0
1  3.0
2  1.0
3  4.0

In [12]:
df.rank(axis=0, method='min',ascending=False)

     a
0  3.0
1  2.0
2  4.0
3  1.0

In [13]:
frame=pd.DataFrame({'b':[5,7,-3,2],'a':[0,1,0,1],'c':[-2,5,8,-3]})
frame.head()

   b  a  c
0  5  0 -2
1  7  1  5
2 -3  0  8
3  2  1 -3

In [34]:
k = []
for method in ['average', 'max', 'min']:
    k.append(pd.DataFrame(frame.apply(lambda x: x.rank(method=method))))
pd.concat(k, axis=1)

     b    a    c    b    a    c    b    a    c
0  3.0  1.5  2.0  3.0  2.0  2.0  3.0  1.0  2.0
1  4.0  3.5  3.0  4.0  4.0  3.0  4.0  3.0  3.0
2  1.0  1.5  4.0  1.0  2.0  4.0  1.0  1.0  4.0
3  2.0  3.5  1.0  2.0  4.0  1.0  2.0  3.0  1.0

## melt

In [50]:
pd.melt(titanic, id_vars=['age'],
           value_vars=['sex']).sort_values(by='age').head()

      age variable   value
803  0.42      sex    male
755  0.67      sex    male
644  0.75      sex  female
469  0.75      sex  female
78   0.83      sex    male

## Select

In [51]:
frame.head()

   b  a  c
0  5  0 -2
1  7  1  5
2 -3  0  8
3  2  1 -3

## where

In [53]:
frame.where(lambda x: x> 2)

     b   a    c
0  5.0 NaN  NaN
1  7.0 NaN  5.0
2  NaN NaN  8.0
3  NaN NaN  NaN